balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F96J60.PIC
    <edc:Pin>
      <!-- 83 -->
      <edc:VirtualPin edc:name="RD7"/>
      <edc:VirtualPin edc:name="AD7"/>
      <edc:VirtualPin edc:name="PSP7"/>
      <edc:VirtualPin edc:name="SS2"/>
    </edc:Pin>
    <edc:Pin>
      <!-- 84 -->
      <edc:VirtualPin edc:name="RD6"/>
      <edc:VirtualPin edc:name="AD6"/>
      <edc:VirtualPin edc:name="PSP6"/>
      <edc:VirtualPin edc:name="SCK2"/>
      <edc:VirtualPin edc:name="SCL2"/>
    </edc:Pin>
    <edc:Pin>
      <!-- 85 -->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!-- 86 -->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!-- 87 -->
      <edc:VirtualPin edc:name="RD5"/>
      <edc:VirtualPin edc:name="AD5"/>
      <edc:VirtualPin edc:name="PSP5"/>
      <edc:VirtualPin edc:name="SDI2"/>
      <edc:VirtualPin edc:name="SDA2"/>
    </edc:Pin>
    <edc:Pin>
      <!-- 88 -->
      <edc:VirtualPin edc:name="RD4"/>
      <edc:VirtualPin edc:name="AD4"/>
      <edc:VirtualPin edc:name="PSP4"/>
      <edc:VirtualPin edc:name="SDO2"/>
    </edc:Pin>
    <edc:Pin>
      <!-- 89 -->
      <edc:VirtualPin edc:name="RD3"/>
      <edc:VirtualPin edc:name="AD3"/>
      <edc:VirtualPin edc:name="PSP3"/>
    </edc:Pin>
    <edc:Pin>
      <!-- 90 -->
      <edc:VirtualPin edc:name="RD2"/>
      <edc:VirtualPin edc:name="AD2"/>
      <edc:VirtualPin edc:name="PSP2"/>
    </edc:Pin>
    <edc:Pin>
      <!-- 91 -->
      <edc:VirtualPin edc:name="RD1"/>
      <edc:VirtualPin edc:name="AD1"/>
      <edc:VirtualPin edc:name="PSP1"/>
    </edc:Pin>
    <edc:Pin>
      <!-- 92 -->
      <edc:VirtualPin edc:name="RD0"/>
      <edc:VirtualPin edc:name="AD0"/>
      <edc:VirtualPin edc:name="PSP0"/>
    </edc:Pin>
    <edc:Pin>
      <!-- 93 -->
      <edc:VirtualPin edc:name="RE7"/>
      <edc:VirtualPin edc:name="AD15"/>
      <edc:VirtualPin edc:name="ECCP2"/>
      <edc:VirtualPin edc:name="P2A"/>
    </edc:Pin>
    <edc:Pin>
      <!-- 94 -->
      <edc:VirtualPin edc:name="RE6"/>
      <edc:VirtualPin edc:name="AD14"/>
      <edc:VirtualPin edc:name="P1B"/>
    </edc:Pin>
    <edc:Pin>
      <!-- 95 -->
      <edc:VirtualPin edc:name="RE5"/>
      <edc:VirtualPin edc:name="AD13"/>
      <edc:VirtualPin edc:name="P1C"/>
    </edc:Pin>
    <edc:Pin>
      <!-- 96 -->
      <edc:VirtualPin edc:name="RE4"/>
      <edc:VirtualPin edc:name="AD12"/>
      <edc:VirtualPin edc:name="P3B"/>
    </edc:Pin>
    <edc:Pin>
      <!-- 97 -->
      <edc:VirtualPin edc:name="RE3"/>
      <edc:VirtualPin edc:name="AD11"/>
      <edc:VirtualPin edc:name="P3C"/>
    </edc:Pin>
    <edc:Pin>
      <!-- 98 -->
      <edc:VirtualPin edc:name="RE2"/>
      <edc:VirtualPin edc:name="AD10"/>
      <edc:VirtualPin edc:name="CS"/>
      <edc:VirtualPin edc:name="P2B"/>
    </edc:Pin>
    <edc:Pin>
      <!-- 99 -->
      <edc:VirtualPin edc:name="RH0"/>
      <edc:VirtualPin edc:name="A16"/>
    </edc:Pin>
    <edc:Pin>
      <!-- 100 -->
      <edc:VirtualPin edc:name="RH1"/>
      <edc:VirtualPin edc:name="A17"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>